#ifdef __cplusplus
extern "C" {
#endif
/*==================================================================================================

    MODULE NAME : gif_to_bmp.c

    GENERAL DESCRIPTION
        functions for unicode encoding string.

    TECHFAITH Telecom Confidential Proprietary
    (c) Copyright 2002 by TECHFAITH Telecom Corp. All Rights Reserved.
====================================================================================================

    Revision History
   
    Modification                  Tracking
    Date         Author           Number      Description of changes
    ----------   --------------   ---------   -----------------------------------------------------------------------------------
    03/24/2002   Andyli                         Initial Creation
    06/16/2003   Tree Zhan                      improve the speed of uncompressed gif file
    07/26/2003   lindawang        P000973       remove animal_buffer.
    08/16/2003   Tree Zhan        P001241       improve the speed of uncompressed gif file
    08/22/2003   shifeng          P001304       fixed the bug of displaying some gif file error.
    08/25/2003   shifeng          P001369       add code to tackle NULL pointer situation.
    08/27/2003   shifeng          P001388       solve the problem of resolving local colour pallet 
                                                error and reduce gif decoding memory spending
    08/28/2003   Tree Zhan        P001419       Fix gif not release problem
    10/14/2003   linda wang       C001806       Add function of setting download image to desktop.
    11/05/2003   shifeng          P001979       Fixed a bug that playing some gif file cause handset reboot.
    12/17/2003   linda wang       P002201     Add gif decode error handler and fix bug for download image display.
    04/02/2004   shifeng          P002831       fixed the bug of loop error when view cect.cmn.kongzhon.com/index.jsp
    06/03/2004   penghaibo        P005888       fixed the bug of unsupported gif file
    08/26/2004   penghaibo        p007954       fix bug of memery leak when a page comtainmore then five gif image
    Self-documenting Code
    Describe/explain low-level design of this module and/or group of funtions and/or specific
    funtion that are hard to understand by reading code and thus requires detail description.
    Free format !
        
====================================================================================================
    INCLUDE FILES
==================================================================================================*/

#include "APP_include.h"
#include "gif_to_bmp.h"


/*==================================================================================================
    LOCAL CONSTANTS
==================================================================================================*/
#define GIFHEADER_SIZE               13
#define IMAGEDATAINFO_SIZE           10
#define GRAPHCTRL_SIZE               8
#define APPCTRL_SIZE                 271
#define TEXTCTRL_SIZE                270
#define NOTEHCTRL_SIZE               259
#define MAX_GIF_NUMBER               50
#define PART_IMAGE_DATA_BUFFER_SIZE  sizeof(OP_UINT16)*5200
#define BITMAP_PALLET_SIZE           256
#define LZWTABLE_SIZE                5200
#define LZWTABLE_MAX_SEEK_TIMES      15000
#define MAX_CODES 4095

/*==================================================================================================
    LOCAL TYPEDEFS - Structure, Union, Enumerations...etc
==================================================================================================*/


typedef struct
{
    OP_UINT16 FileType; /* 89a or 87a */
    OP_UINT16 ColorType;/* 1,2,4,8,16,32,64,128,256 */
    OP_UINT16 ColorMode;/* 1,2,3,4,5,6,7,8 */
    OP_UINT16 Width;
    OP_UINT16 Height;
    OP_UINT16 FrameCount;
    OP_UINT8  InitPixelBits;
}GIFINFO;

typedef struct
{
    OP_UINT8 bRed;
    OP_UINT8 bGreen;
    OP_UINT8 bBlue;
}MYRGB;

/*
 * RGB structure, it is no use now, may be use future
 */
typedef struct 
{ 
    OP_UINT8    rgbBlue; 
    OP_UINT8    rgbGreen; 
    OP_UINT8    rgbRed; 
    OP_UINT8    rgbReserved; 
}RGB_QUAD;

typedef struct
{
    short        tColor;
    OP_UINT16    DelayTime;
    OP_UINT16    Left;
    OP_UINT16    Top;
    OP_UINT16    Width;
    OP_UINT16    Height;
    RGB_QUAD     Palette[256];    
    OP_UINT8*    pImageData;
    OP_BOOLEAN   SaveMode;/*1 = normal; 0 = e*/
}BMPIMAGE;


typedef struct
{
    OP_UINT8  Signature[6];
    OP_UINT16 ScreenWidth;
    OP_UINT16 ScreenDepth;
    OP_UINT8  GlobalFlagByte;
    OP_UINT8  BackGroundColor;
    OP_UINT8  AspectRadio;
}GIFHEADER;

typedef struct _graph_ctrl_struct
    {
    OP_UINT8    TransparentColorFlag:1;
    OP_UINT8    UseInputFlag:1;
    OP_UINT8    DisposalMethod:3;
    OP_UINT8    Reserved:3;
} graph_ctrl_struct;

typedef struct _image_ctrl_struct
    {
    OP_UINT8   l_color_table_size:3;
    OP_UINT8   reserved:2;
    OP_UINT8   sort_flag:1;
    OP_UINT8   interlace_mode:1;
    OP_UINT8   l_color_table:1;
    } image_ctrl_struct;

typedef struct
{
    OP_UINT8   ExtIntr;// 0x21    
    OP_UINT8   Label;//0xF9
    OP_UINT8   BlockSize;//0x04
    graph_ctrl_struct   graph_ctrl;
    OP_UINT16  DelayTime;
    OP_UINT8   TranColorIndex;
    OP_UINT8   blockTerminator;//0x00
}GRAPHCTRL;

typedef struct
{
    OP_UINT8   ImageLabel;/* default 0x2c */
    OP_UINT16  ImageLeft; 
    OP_UINT16  ImageTop;
    OP_UINT16  ImageWidth;
    OP_UINT16  ImageHeight;
    image_ctrl_struct   image_ctrl; 
    GRAPHCTRL  graphctrl;
    OP_UINT8 * image_data;
}IMAGEDATAINFO;

typedef struct
{
    OP_UINT16 Header;
    OP_UINT16 Tail;
    OP_UINT16 Code; 
}LZWTABLE;



typedef struct
{
    OP_UINT8 ExtIntr;// 0x21    
    OP_UINT8 Label;//0xFE
    OP_UINT8 Data[256];//256
    OP_UINT8 blockTerminator;//0x00
}NOTEHCTRL;

typedef struct
{
    OP_UINT8     ExtIntr;// 0x21    
    OP_UINT8     Label;//0x01
    OP_UINT8     BlockSize;//0x0c
    OP_UINT16    Left;
    OP_UINT16    Top;
    OP_UINT16    Width;
    OP_UINT16    Height; 
    OP_UINT8     ForeColorIndex;
    OP_UINT8     BkColorIndex;
    char         Data[256];
    OP_UINT8     blockTerminator;//0x00
}TEXTCTRL;
typedef struct
{
    OP_UINT8 ExtIntr;// 0x21    
    OP_UINT8 Label;//0xFF
    OP_UINT8 BlockSize;//0x0b
    OP_UINT8 Identifier[8];
    OP_UINT8 Authentication[3];
    OP_UINT8 Data[256];
    OP_UINT8 blockTerminator;//0x00
}APPCTRL;

typedef struct
{
    OP_UINT32   m_HeaderSize;
    GIFINFO     m_GifInfo;
    OP_UINT8    *m_pDataArea;
    OP_UINT8    *m_TailPointer;
    OP_UINT32   m_fileSize;
    OP_UINT16   m_GLBRgbQuad[BITMAP_PALLET_SIZE];/* Bitmap pattlen; */
    OP_UINT16   *p_CurRgbQuad;
    OP_UINT8    BackGroundColor;
    OP_UINT16   m_ScreenWidth;
    OP_UINT16   m_ScreenHeight;
    IMAGEDATAINFO prevImage;
    IMAGEDATAINFO currImage;
    OP_UINT32   offset_length;
    OP_UINT32   Offset;
    OP_BOOLEAN  first_enty;
    OP_UINT8    *pgifData;
}GIF_INFO_STRUCTRUE_T;

typedef struct
{
    OP_UINT32     handle;
    OP_BOOLEAN    bUse;
    GIF_INFO_STRUCTRUE_T *pGifInfo;
}GIF_INFO_ARRAY_STRUCTRUE_T;

typedef enum 
{
    GET,
    RELEASE
} BUFFER_PARAM_ENUM;

typedef struct _LZW_DECODE_CRTL {
    OP_INT16 curr_size;                     /* The current code size */
